--[[
ســــورس ابــو عســولةة
THE_TETOO_NEW FOR 
ENGELESH AND ARBCK
--]]


do

function run(msg, matches)
  return [[ 
🎀🎖ســـورس تـيـتو الـتحـديث الـرابـع

🎀🎁ســـورس عـربي و نكـلـيزي


🎀🎖للاظـهار الاوامـر العربيه ارسل مسـاعدة

🎀🎖للاظـهار الاوامر الانكليزية ارسل /help


🎀🎁ملاحـظه اوامر نكليـزيه تعمل مع [/!#] و العـربيه لا تعـمل

➖➖➖➖➖

🎀🎖مـطور الســورس 
🎀🎖 @l_l_lo
🎀🎖قـناه السـورس
🎀🎖 @no_no2
🎀🎖بـوت تواصل السـورس
🎀🎖 @k4k33_bot

 ]]

end

return {
  description = "Shows bot help", 
  -- usage = الاوامر: Shows bot help",
  patterns = {
    "^الاوامر$"
  }, 
  run = run 
}

end
