--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀ 
▀▄ ▄▀                                     ▀▄ ▄▀ 
▀▄ ▄▀    BY tetoo                         ▀▄ ▄▀ 
▀▄ ▄▀     BY nmore       (@l_l_lo)        ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY l_l_ll               ▀▄ ▄▀ 
▀▄ ▄▀       broadcast  : help ar          ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀ 
--]]

do
function run(msg, matches)
 if matches[1] == "/help" and is_momod(msg) then
    return "🎀🎖اهـلا بـك عـزيـزي 😻   "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
⏺WeLcoOomE 
🎀🎖سـورس تيـتو الانكليـزي

🎀🎖 /he1 :- اوامر الاداريه في الكروب

🎀🎖 /he2 :- اوامر الـطرد و الحظر في الكروب

🎀🎖 /he3 :-اومر الحمايـةة في الكروب

🎀🎖/he4 :- اوامر المـطور في الكروب

➖➖➖➖➖

🎀🎖مـطور الســورس
🎀🎖 @l_l_lo
🎀🎖قنـاة السـورس
🎀🎖 @no_no
🎀🎖بـووت تواصل السورس
🎀🎖 @k4k33_bot

]]
------------------

  elseif matches[1] == "/he1" and is_momod(msg) then
    return "🎀🎖اهـلا بـك عـزيـزي 😻  "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
 🎀🎖اوامـر الادريه في سـورس تيـتو نكليـزي
#تسـتخدم معها [/!#]
➖➖➖➖➖➖

🎀🎖/who 🏅قائمه اعـضاء الكـروب

🎀🎖/info 🏅معلـوماتـي

🎀🎖/gpinfo 🏅معلومات الكروب

🎀🎖/me 🏅مـوقعـي 

🎀🎖/id 🏅ايـدي الكروب او برد لضهور ايدي العضو

🎀🎖/link 🏅لضهور رابط الكروب

🎀🎖/ setlink 🏅وضع رابط

🎀🎖/newlink 🏅وضع رابط جديد

🎀🎖/setrules 🏅وضع قـوانـين

🎀🎖/rules 🏅لضهور القـوانين

🎀🎖/setabout 🏅لوضـع وصف

🎀🎖/setname 🏅 لـوضع اسـم

🎀🎖/setwlc 🏅لـوضع الترحـيب 

🎀🎖/setbye 🏅 لـوضع تـوديع

🎀🎖/setphoto 🏅لـوضع صوره

➖➖➖➖➖➖
🎀🎖مـطور الســورس
🎀🎖 @l_l_lo
🎀🎖قنـاة السـورس
🎀🎖 @no_no
🎀🎖بـووت تواصل السورس
🎀🎖 @k4k33_bot

🎀🎖معـرف مـطور البـوت 
@اكتب معرفك و لا تحذف حقوقنا


]]
------------------


  elseif  matches[1] == "/he2" and is_momod(msg) then 
    return "🎀🎖اهـلا بـك عـزيـزي 😻   "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
 🎀🎖اوامر الـترقيـةة و الحظر فـي ســورس تيــتو نكلـيزي
#تســتخدم معهـا [/!#]

🎀🎖اوامــر الـترقيةة

🎀🎖/promote 🏅رفع ادمن

🎀🎖/demote 🏅تنزيل ادمن

🎀🎖/setadmin 🏅رفع اداري

🎀🎖 /demoteadmin 🏅  تنـزيل اداري

🎀🎖/admins 🏅عرض الادمنيةة

🎀🎖/who 🏅عـرض الاعضاء

🎀🎖اومـر الحـظر 

🎀🎖 /kick + @ 🏅طرد 

🎀🎖 /block + @ 🏅 بلوك 

🎀🎖 /ban + @ 🏅 حظر 

🎀🎖 / unban + @ 🏅 الغاء الحظر

🎀🎖/ banlist 🏅المحظوريــن 

🎀🎖/silent 🏅كتـم 

🎀🎖/id 🏅ايدي 

🎀🎖 / kickme 🏅 مغادرة

🎀🎖/leave 🏅لـطرد البــوت

🎀🎖مـطور الســورس
🎀🎖 @l_l_lo
🎀🎖قنـاة السـورس
🎀🎖 @no_no
🎀🎖بـووت تواصل السورس
🎀🎖 @k4k33_bot

]]
------------------

  elseif  matches[1] == "/he3" and is_momod(msg) then 
    return "🎀🎖اهـلا بـك عـزيـزي 😻 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  
  🎀🎖اوامـر الـحمـايةة في ســورس تيـتو نكليـزي
#تسـتخدم معهـا [/!#]

🎀🎖قائمــةة المنع

🎀🎖/mute و امر للمنع

🎀🎖/unmute وامـر للفك المنع

🎀🎖audio 🏅الصـوت 

🎀🎖photo 🏅الصور

🎀🎖video 🏅الفيـديو 

🎀🎖gifs 🏅الصور المتحركةة
 
🎀🎖text 🏅الكتابةة

🎀🎖قائمــةة القفل

🎀🎖/lock و امر للقفل

🎀🎖/unlock وامر للفتح

🎀🎖/links 🏅 الروابط

🎀🎖/ flood 🏅 التكرار

🎀🎖/ spam 🏅الكلايـش 

🎀🎖/sticker 🏅 الملصقـاات

🎀🎖/tag 🏅تاك 

🎀🎖/ emoji 🏅الـسمايلات 

🎀🎖/bots 🏅البوتاات

🎀🎖/fwd 🏅اعادة توجيةة

🎀🎖/media 🏅الوسـائط او الميديا

🎀🎖/leave 🏅المغـادرةة

🎀🎖/all 🏅الكل


🎀🎖مـطور الســورس 
🎀🎖 @l_l_lo
🎀🎖قـناه السـورس
🎀🎖 @no_no2
🎀🎖بـوت تواصل السـورس
🎀🎖 @k4k33_bot


]]
------------------

  elseif  matches[1] == "/he4" and is_momod(msg) then 
    return "🎀🎖اهـلا بـك عـزيـزي 😻 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🎀🎖اوامـر الـمـطـور في ســورس تيـتو نكليـزي
#تسـتخدم معهـا [/!#]

🎀🎖/addbot 🏅تـفعـيل البـوت

🎀🎖/rembot 🏅تعـطيل البـوت

🎀🎖/creategroup 🏅صـنع كـروب

🎀🎖/tosuper 🏅تحويل سـوبـر

🎀🎖/serverinfo 🏅معـلومات السيـرفر

🎀🎖/send 🏅جلب ملف

🎀🎖/p 🏅الملفات 

🎀🎖 /p + اسم ملف 🏅 لتفعيل الملف

🎀🎖/p - اسم ملف 🏅لتعـطيل الملف

🎀🎖/run 🏅 للاعــادة تشـغيل البـوت

🎀🎖/leave 🏅 لـطرد البـوت


🎀🎖مـطور الســورس 
🎀🎖 @l_l_lo
🎀🎖قـناه السـورس
🎀🎖 @no_no2
🎀🎖بـوت تواصل السـورس
🎀🎖 @k4k33_bot


]]
------------------------

 elseif  matches[1] == "الاوامر" and is_momod(msg) then 
    return "🎀🎖اهـلا بـك عـزيـزي 😻   "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🎀🎁ســـورس عـربي و نكـلـيزي


🎀🎖للاظـهار الاوامـر العربيه ارسل مسـاعدة

🎀🎖للاظـهار الاوامر الانكليزية ارسل /help


🎀🎁ملاحـظه اوامر نكليـزيه تعمل مع [/!#] و العـربيه لا تعـمل

➖➖➖➖➖

🎀🎖مـطور الســورس 
🎀🎖 @l_l_lo
🎀🎖قـناه السـورس
🎀🎖 @no_no2
🎀🎖بـوت تواصل السـورس
🎀🎖 @k4k33_bot

]]
-----------------------

 elseif  matches[1] == "م6" and is_sudo(msg) then 
    return "🎀🎖اهـلا بـك عـزيـزي 😻  "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  انجـب ابـن نعال ويـن اكـو هيـج 
  ]]
  end
end
return {
  patterns = {
    "^(/help)",
    "^(/he1)",
    "^(/he2)",
    "^(/he3)",
    "^(/he4)",
    "^(الاوامر)",
    "^()",
    
  },
  run = run
}
end

---by tetoo
-- @l_l_lo
