
do

function (msg, matches)
local reply_id = msg['id']
local S = [[ 
▇▆▅ اوامـر المجمـوعـه ▅▆▇

🔱⚠️ ضع صـورة 🔲 لوضع صورة

🔱⚠️ ضع قوانيـن 🔲 لـوضع قـوانين

🔱⚠️ ضع معـرف 🔲 لـوضع معـرف 

🔱⚠️ ضـع وصـف🔲 لوضع وصـف

🔱⚠️ ضـع اســم 🔲 لوضع اسم

🔱⚠️ ضـع رابط 🔲 لوضع رابط كروب

🔱⚠️الـرابـط 🔲 لعرض رابط مجموعه

🔱⚠️ الـرابط خاص 🔲 لوصول رابـط خاص

🔱⚠️ القـوانين 🔲 لـعرض القــوانين

🔱⚠️ المـطور 🔲 لعـرض معلومات بطـور
🔱⚠️معلـوماتي 🔲 لعـرض معلـوماتي

⚠️🔱 ايدي 🔲 لعرض ايدي مجموعـه

⚠️🔱ايدي بلـرد 🔲 لعـرض ايدي عضـو

⚠️🔱 الاعـدادات 🔲 لعـرض اعدادات مجموعه

🔱⚠️قائمه المحظورين 🔲 لعـرض محضورين

🔱⚠️ قائمه الـعام 🔲 لعـرض محضورين عام

🔱⚠️ اعدادات الـوسائط 🔲 لعـرض الوسائط

➖✖️➖✖️➖✖️➖✖️➖✖️➖✖️
🔲 قـناه السـورس
🔳 @no_no2
🔲 مــطور الســورس
🔳 @l_l_lo
🔲بـوت تواصـل ملعونيـن
🔳k4k3_bot

]]
reply_msg(reply_id, S, ok_cb, false)
end

return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(م2)$",
},
run = 
}
end
