
do

function (msg, matches)
local reply_id = msg['id']
local S = [[ 
❗️ أوامر الحماية في المجموعة
➖🔹➖🔹➖🔹➖🔹➖🔹
▫️ قفل الفيديو :: لقفل الفيديو
▫️ قفل الصور :: لقفل الصور
▫️ قفل الصوت :: لقفل الصوت
▫️ قفل الوسائط :: لقفل الوسائط
▫️ قفل الملصقات :: لقفل الملصقات
▫️ قفل الصور المتحركة :: لقفل المتحركه
➖🔹➖🔹➖🔹➖🔹➖🔹
▫️ فتح الفيديو :: لفتح الفيديو
▫️ فتح الصور :: لفتح الصور
▫️ فتح الصوت :: لفتح الصوت
▫️ فتح الوسائط :: لفتح الوسائط
▫️ فتح الملصقات :: لفتح الملصقات
▫️ فتح الصور المتحركة :: لفتح التحركه
➖🔹➖🔹➖🔹➖🔹➖🔹
المــطور 
@l_l_lo
القـناه 
@no_no2
بوت تواصــل 
@k4k3_bot

 ]]
reply_msg(reply_id, S, ok_cb, false)
end

return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(م4)$",
},
run = 
}
end
