do

local function run(msg, matches)

local reply_id = msg['id']
if is_momod(msg) and matches[1] == 'م المطور' then 
    local ghost = [[
▁▃▄▅▇☹️اوامـر المـطور☹️▇▆▅▃▁
🔱⚠️ تفعيل —- للتفعـيل البـوت
🔱⚠️ تعطيل —- للتعـطيل البـوت
🔱⚠️ موقعي —— لاضهار موقعك
🔱⚠️ معلوماتي —- للمعلومات العـضـو
🔱⚠️ الملفات —— لاظهـار ملفات البـوت 
🔱⚠️ تفعيل ملف —- تفعيل ملف +اسم
🔱⚠️ تعطيل ملف —- تعطيل ملف +اسم
🔱⚠️طرد البوت —--لمغادره البوت 
🔱⚠️ اذاعه —- للبـث في جميع كروبات بوت
🔱⚠️تفعيل لمده —----للتفعيل بوت لمده محدوده
🔱⚠️ رد اضـف —--لاضافه رد
🔱⚠️ رد حذف —-لحذف رد
🔱⚠️الردود —--لعرض الردود
🔱⚠️تاك كلمه —---لعمل تاك
🔱⚠️صـنع مجموعة —---لصنع مجموعه داخل بوت
➖✖️➖✖️➖✖️➖✖️➖✖️
🔲قــناه الســورس
🔳 @no_no2
🔲مـطور الســورس
🔳 @l_l_lo
🔲بـوت تواصـل محضـورين
🔳 @k4k3_bot
]]
  reply_msg(reply_id, ghost, ok_cb, false) 
end 

local reply_id = msg['id'] 
if not is_momod(msg) then 
local ghost = "للـمـشـرفـيـن فـقـط 🌝😹" 
reply_msg(reply_id, ghost, ok_cb, false) 
end 

end 
return { 
patterns ={ 
  "^(م المطور)$", 
}, 
run = run 
} 
end
