do 

function run(msg, matches) 
  return [[ 
ســورس تيـتـو_نيـو🎖 TETOO_NEW
تـابع قـنـاه
@no_no2

⍆جمـيع الاوامـر شـغاله⍅

➖🎖➖🎖➖🎖
🎀🎗 م1🎖لـعرض اوامر الاولـيه 

🎀🎗 م2🎖لـعرض اوامـر الاداريـه

🎀🎗 م3🎖لـعرض اوامر الحمـايه

🎀🎗 م المطور🎖لعـرض اوامر المـطور
➖➖➖➖➖➖➖
◤ ســـــورس تيـتــو_نيـــو
🎀🎗مــطور الــسـورس
🎖➖ @l_l_lo
🎖➖ @ll15l
🎀🎗بــوت الــتواصـل
🎖➖ @k4k3_bot

🎀🎗قـناه الســورس
🎖➖ @no_no2
◢


]] 

end 

return { 
description = "Help list", 
usage = "Help list", 
patterns = { 
"^(الاوامر)$", 
}, 
run = run 
} 
end
