do

local function run(msg, matches)

local reply_id = msg['id']
if is_momod(msg) and matches[1] == 'م2' then 
    local ghost = [[
ســورس تيـتـو_نيــو🎖 TETOO_NEW
تـابع قـنـاه
@no_no2
❀ اوامرالاداريه فـي المجمـوعه  ❀

➖➖🎖➖➖🎗➖➖🎖➖➖
🎀🎗معلـوماتـي 🎖لعـرض معـلومات العـضو

🎀🎗معـلومات 🎖لعـرض معلـومات الكروب

🎀🎗الاعـدادات 🎖لعـرض اعـدادات فـي الكروب

🎀🎗 موقعي 🎖لـعرض موقعك في الكروب

🎀🎗 /ايدي 🎖لـعرض ايدك و موقعك

🎀🎗 الاعـضـاء 🎖لـعـرض اعظاء الكـروب

❀❀ اوامـر الـترقيـه ❀❀

🎀🎗 رفع ادمن 🎖 لرفع عضـو ادمن

🎀🎗الادمنـيه 🎖لـعرض ادمنيـه الكـروب

🎀🎗 الـرابـط 🎖لجـلب رابـط الـكروب

🎀🎗وضـع رابـط 🎖لوضـع رابـط الـكروب

🎀🎗 رابـط جديد 🎖 لوضع رابـط جديد

➖➖➖➖➖➖➖
◤ ســـــورس تيـتــو_نيـــو
🎀🎗مــطور الــسـورس
🎖➖ @l_l_lo
🎖➖ @ll15l
🎀🎗بــوت الــتواصـل
🎖➖ @k4k3_bot

🎀🎗قـناه الســورس
🎖➖ @no_no2
◢

]]
  reply_msg(reply_id, ghost, ok_cb, false) 
end 

local reply_id = msg['id'] 
if not is_momod(msg) then 
local ghost = "للـمـشـرفـيـن فـقـط 🌝😹" 
reply_msg(reply_id, ghost, ok_cb, false) 
end 

end 
return { 
patterns ={ 
  "^(م2)$", 
}, 
run = run 
} 
end
