--[[
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀
▀▄ ▄▀                                 ▀▄ ▄▀
▀▄ ▄▀  Team name : (  🌐 VIP_TEAM 🌐  )▀▄ ▄▀
▀▄ ▄▀                                 ▀▄ ▄▀
▀▄ ▄▀   File name : ( #all )          ▀▄ ▄▀
▀▄ ▄▀                                 ▀▄ ▄▀
▀▄ ▄▀  Guenat team: ( @VIP_TEAM1  )   ▀▄ ▄▀
▀▄ ▄▀                                 ▀▄ ▄▀
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄
—]]
do
local function run(msg,matches)
if not is_momod(msg) then 
  return "🙇🏻 عذرا "..msg.from.first_name.."\n"
  .."🚀للمدراء فقط  "
    end
if is_momod(msg) then 
  return "مرحبا عزيزي 🔮 "..msg.from.first_name.."\n"
  .."🚀اسم المجموعة  : ".."\n"..msg.to.title.."\n"
  .."  ".."\n"
  ..[[
اوامر حماية  المجموعة 🕹
تعمل جميع لاوامر ب {/!#} 💡 
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹  
اوامر قفل الميديا ⁉️ /قفل 🕹 للمنع 🕹 /فتح 🕹 للسماح 🕹
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
📊/قفل الصور : لقفل الصور 🕹      
📊/فتح الصور : لفتح الصور 🕹
📊/قفل المتحركة : لقفل الصور المتحركة 🕹
📊/فتح المتحركة : لفتح الصور المتحركة 🕹
📊/قفل الفديو : لقفل الفديو 🕹
📊/فتح الفديو : لفتح الفديو 🕹
📊/قفل الملفات : لقفل الملفات 🕹
📊/فتح الملفات : لفتح الملفات 🕹 
📊/قفل الدردشة : لقفل الدردشة 🕹 
📊/فتح الدردشة : لفتح الدردشة 🕹
📊/قفل الكل  : لقفل الدردشة مع تحذير 🕹
📊/فتح الكل : لفتح الدردشة  🕹
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
اوامر قفل الحماية 🕹 /امنع 🕹 للمنع ➖ 🕹/اسمح 🕹 للسماح 🕹
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
📊/امنع السبام : لقفل الكلايش الطويله 🕹 
📊/اسمح السبام : لفتح الكلايش الطويله 🕹 
📊/امنع التكرار : لقفل التكرار 🕹
📊/اسمح التكرار : لفتح التكرار 🕹 
📊/امنع الملصقات : لقفل الملصقات 🕹
📊/اسمح الملصقات : لفتح الملصقات 🕹
📊/امنع الكلمات السيئة : لقفل الكلمات السيئة 🕹
📊/اسمح الكلمات السيئة : لفتح الكلمات السيئة 🕹
📊/امنع البوتات : لقفل البوتات 🕹
📊/اسمح البوتات : لفتح البوتات 🕹
📊/امنع  التوجيه : لقفل اعادة توجيه 🕹
📊/اسمح  التوجيه : لفتح اعادة توجيه 🕹
📊/امنع اشعارات الدخول : لقفل اشعارات الدخول 🕹
📊/اسمح اشعارات الدخول : لفتح اشعارات الدخول 🕹
📊/امنع الرتل : لقفل الرتل 🕹
📊/اسمح الرتل : لفتح الرتل 🕹
📊/امنع الدخول عبر الرابط : لقفل الدخول عبر الرابط 🕹
📊/امنع الردود : لقفل الردود 🕹
📊/اسمح الردود : لفتح الردود 🕹
📊/امنع الميديا : لقفل الميديا 🕹 
📊/اسمح الميديا : لفتح الميديا 🕹 
📊/امنع اليوزرنيم : لقفل التاك 🕹
📊/اسمح اليوزرنيم : لفتح التاك 🕹
📊/امنع الكلمات السيئة : لقفل الكلمات السيئة 🕹
📊/اسمح الكلمات السيئة : لفتح الكلمات السيئة🕹
📊/امنع الجهات : لمنع جهات الاتصال 🕹
📊/اسمح الجهات : لفتح جهات الاتصال 🕹
📊/امنع السمايلات : لقفل السمايل 🕹
📊/اسمح السمايلات : لفتح السمايل🕹   


]].."\n"
.."➖➖➖➖➖➖➖➖".."\n"
.."📛قناتنا : @vip_team1 ".."\n"
.."🔶التاريخ : "..os.date('%A, %B, %d, %Y\n' , timestamp)
.."➖➖➖➖➖➖➖➖".."\n"
.."🔹الوقت : "..os.date(' %T', os.time()).."\n"
   end
end
  
  return  {
    patterns = {
      "^[!/#](اوامر2)"
},
  run = run,
}
end