--[[
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀
▀▄ ▄▀                                 ▀▄ ▄▀
▀▄ ▄▀  Team name : (  🌐 VIP_TEAM 🌐  )▀▄ ▄▀
▀▄ ▄▀                                 ▀▄ ▄▀
▀▄ ▄▀   File name : ( #اسم الملف هنا )    ▀▄ ▄▀
▀▄ ▄▀                                 ▀▄ ▄▀
▀▄ ▄▀  Guenat team: ( @VIP_TEAM1  )   ▀▄ ▄▀
▀▄ ▄▀                                 ▀▄ ▄▀
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄
—]]
do
local function run(msg,matches)
if not is_momod(msg) then 
  return "🙇🏻 عذرا "..msg.from.first_name.."\n"
  .."🚀للمدراء فقط  "
    end
if is_momod(msg) then 
  return "مرحبا عزيزي 🔮 "..msg.from.first_name.."\n"
  .."🚀اسم المجموعة  : ".."\n"..msg.to.title.."\n"
  .."  ".."\n"
  ..[[
📊/تفعيل الحماية : لتفعيل البوت 🕹
📊/ازالة الحماية : لازالة البوت 🕹
📊/banall.     : لحضر عضو من جميع مجموعات البوت 🕹
📊/unbanall.     : لالغاء العام 🕹
📊/صنع مجموعة : لصنع مجموعه 🕹
📊/banalllist : لاضهار المحضورين عام🕹
📊/رفع المدير : لرفع مشرف 🕹
📊/رفع مساعد : لرفع مساعد مطور 🕹
📊/انزل مساعد : لتنزيل مساعد مطور 🕹
📊/دخول الى الرابط + الرابط : لدخول البوت الى مجموعة 🕹
📊/نشر : لنشر في كل مجموعات البوت 🕹
📊/سوبر : لتحويل الى سوبر 🕹
📊/ارسل ملف + اسم لملف : لارسال ملف 🕹
📊/غادر البوت ؛ لخروج البوت مـن لمجموعه 🕹
📊/تفعيل ملف : لتفعيل ملفات 🕹
📊/تعطيل ملف : لايقاف ملف 🕹
📊/الملفات : لاضهار الملفات 🕹
📊/حذف : لحذف عدد رسائل بلكروب🕹
📊/تنشيط : اعادة لتشغيل البوت 🕹
📊/تحديث : لتحديث البوت 🕹
📊/تنضيف : تصحيح الاخطاء 🕹

]].."\n"
.."➖➖➖➖➖➖➖➖".."\n"
.."📛قناتنا : @vip_team1 ".."\n"
.."🔶التاريخ : "..os.date('%A, %B, %d, %Y\n' , timestamp)
.."➖➖➖➖➖➖➖➖".."\n"
.."🔹الوقت : "..os.date(' %T', os.time()).."\n"
   end
end
  
  return  {
    patterns = {
      "^[!/#](اوامر6)"
},
  run = run,
}
end