
do

function run(msg, matches)
return [[

🎀️الـبـوت الـذي يـعـمـل عـلـى مـجـمـوعـات الـسـوبـر 

🎀يـعـمـل الـبـوت عـلـى مـجـمـوعـات سـوبـر تـصـل الـى 5 K عـضـو 

   ≪ تـم صـنـع الـبـوت بـواسـطـه الـمـطـور ≫
   
                      『  @l_l_lo 
                      @ll15l
                      』
                      

                      
🎀️كـل مـا هـو جـديـد عـلـى قـنـاه الـسـورس 
                      
                      [ @no_no2 ]
                      
🎀للاسـتفـسـار راسـل الـمـطـور :                                     
                     @k4k33_bot
                     @l_l_lo
                     
                     Programmable bot : @no_no2▫️
                     
                     Bot continues coder : @k4k3_bot
                     🎀
            
]]
end

return {
description = "Shows bot q", 
usage = "spam Shows bot q",
patterns = {
"^(المطور)$",
},
run = run 
}
end
